package variable;

public class Var6 {
    public static void main(String[] args) {
        int a;
        //System.out.println(a);
        //초기화하지 않은 변수
        /*
        * 컴퓨터에서는 메모리를 여러 시스템이 함께 사용
        * 저장하고 지우은게 아님
        * 메모리 빈 공간을 차지하는데 다른 애가 쓰고 있다
        * 그리고 반납할 때 지우지 않는다
        * 그래서 거기에 뭐가 들어있는지 아무도 모른다
        * 뭔가 초기화하지 않으면 이상한 값이 출력
        * 그래서 자바는 변수 초기화를 강제한다.
        *
        * 나중에는 클래스변수 인스턴스변수 등 여러가지 변수가 있다.
        *
        * 지금 발생한 에러는 컴파일 에러이다.
        * 런타임오류가 발생하지 않고 눈으로 확인 가능한 컴파일 오류가 발생하도록
        * 뭔가 장치를 하는 것이 중요하다.*/
    }
}
